a = 'результат операции: 42'
b = 'результат операции: 514'
c = 'результат работы программы: 9'

index = a.index(':')  # Поиск индекса неизменяемой части
print(int(a[index + 1:]) + 10)  # Найти числа после ":" (пишем + 1 чтобы не учитывать сам символ,
                                # а то будет ошибка при int) и добавление к числу +10
index = b.index(':')  # Поиск индекса неизменяемой части
print(int(b[index + 1:]) + 10)  # Найти числа после ":" (пишем + 1 чтобы не учитывать сам символ,
                                # а то будет ошибка при int) и добавление к числу +10
index = c.index(':')  # Поиск индекса неизменяемой части
print(int(c[index + 1:]) + 10)  # Найти числа после ":" (пишем + 1 чтобы не учитывать сам символ,
                                # а то будет ошибка при int) и добавление к числу +10

# print(int(a[a.index(":") + 1:]) + 10)  # Можно и так - все объединить
